arduino/Arduino/build/linux/arduino-1.8.14/hardware/tools/avr/avr/include/avr/iom4808.h
/* CPUINT - Interrupt Controller */
/* CPUINT.CTRLA  bit masks and bit positions */
#define CPUINT_LVL0RR_bm  0x01  /* Round-robin Scheduling Enable bit mask. */
#define CPUINT_LVL0RR_bp  0  /* Round-robin Scheduling Enable bit position. */
#define CPUINT_CVT_bm  0x20  /* Compact Vector Table bit mask. */
#define CPUINT_CVT_bp  5  /* Compact Vector Table bit position. */
#define CPUINT_IVSEL_bm  0x40  /* Interrupt Vector Select bit mask. */
#define CPUINT_IVSEL_bp  6  /* Interrupt Vector Select bit position. */

/* CPUINT.STATUS  bit masks and bit positions */
#define CPUINT_LVL0EX_bm  0x01  /* Level 0 Interrupt Executing bit mask. */
#define CPUINT_LVL0EX_bp  0  /* Level 0 Interrupt Executing bit position. */
#define CPUINT_LVL1EX_bm  0x02  /* Level 1 Interrupt Executing bit mask. */
#define CPUINT_LVL1EX_bp  1  /* Level 1 Interrupt Executing bit position. */
#define CPUINT_NMIEX_bm  0x80  /* Non-maskable Interrupt Executing bit mask. */
#define CPUINT_NMIEX_bp  7  /* Non-maskable Interrupt Executing bit position. */

/* CPUINT.LVL0PRI  bit masks and bit positions */
#define CPUINT_LVL0PRI_gm  0xFF  /* Interrupt Level Priority group mask. */
#define CPUINT_LVL0PRI_gp  0  /* Interrupt Level Priority group position. */
#define CPUINT_LVL0PRI0_bm  (1<<0)  /* Interrupt Level Priority bit 0 mask. */
#define CPUINT_LVL0PRI0_bp  0  /* Interrupt Level Priority bit 0 position. */
#define CPUINT_LVL0PRI1_bm  (1<<1)  /* Interrupt Level Priority bit 1 mask. */
#define CPUINT_LVL0PRI1_bp  1  /* Interrupt Level Priority bit 1 position. */
#define CPUINT_LVL0PRI2_bm  (1<<2)  /* Interrupt Level Priority bit 2 mask. */
#define CPUINT_LVL0PRI2_bp  2  /* Interrupt Level Priority bit 2 position. */
#define CPUINT_LVL0PRI3_bm  (1<<3)  /* Interrupt Level Priority bit 3 mask. */
#define CPUINT_LVL0PRI3_bp  3  /* Interrupt Level Priority bit 3 position. */
#define CPUINT_LVL0PRI4_bm  (1<<4)  /* Interrupt Level Priority bit 4 mask. */
#define CPUINT_LVL0PRI4_bp  4  /* Interrupt Level Priority bit 4 position. */
#define CPUINT_LVL0PRI5_bm  (1<<5)  /* Interrupt Level Priority bit 5 mask. */
#define CPUINT_LVL0PRI5_bp  5  /* Interrupt Level Priority bit 5 position. */
#define CPUINT_LVL0PRI6_bm  (1<<6)  /* Interrupt Level Priority bit 6 mask. */
#define CPUINT_LVL0PRI6_bp  6  /* Interrupt Level Priority bit 6 position. */
#define CPUINT_LVL0PRI7_bm  (1<<7)  /* Interrupt Level Priority bit 7 mask. */
#define CPUINT_LVL0PRI7_bp  7  /* Interrupt Level Priority bit 7 position. */

/* CPUINT.LVL1VEC  bit masks and bit positions */
#define CPUINT_LVL1VEC_gm  0xFF  /* Interrupt Vector with High Priority group mask. */
#define CPUINT_LVL1VEC_gp  0  /* Interrupt Vector with High Priority group position. */
#define CPUINT_LVL1VEC0_bm  (1<<0)  /* Interrupt Vector with High Priority bit 0 mask. */
#define CPUINT_LVL1VEC0_bp  0  /* Interrupt Vector with High Priority bit 0 position. */
#define CPUINT_LVL1VEC1_bm  (1<<1)  /* Interrupt Vector with High Priority bit 1 mask. */
#define CPUINT_LVL1VEC1_bp  1  /* Interrupt Vector with High Priority bit 1 position. */
#define CPUINT_LVL1VEC2_bm  (1<<2)  /* Interrupt Vector with High Priority bit 2 mask. */
#define CPUINT_LVL1VEC2_bp  2  /* Interrupt Vector with High Priority bit 2 position. */
#define CPUINT_LVL1VEC3_bm  (1<<3)  /* Interrupt Vector with High Priority bit 3 mask. */
#define CPUINT_LVL1VEC3_bp  3  /* Interrupt Vector with High Priority bit 3 position. */
#define CPUINT_LVL1VEC4_bm  (1<<4)  /* Interrupt Vector with High Priority bit 4 mask. */
#define CPUINT_LVL1VEC4_bp  4  /* Interrupt Vector with High Priority bit 4 position. */
#define CPUINT_LVL1VEC5_bm  (1<<5)  /* Interrupt Vector with High Priority bit 5 mask. */
#define CPUINT_LVL1VEC5_bp  5  /* Interrupt Vector with High Priority bit 5 position. */
#define CPUINT_LVL1VEC6_bm  (1<<6)  /* Interrupt Vector with High Priority bit 6 mask. */
#define CPUINT_LVL1VEC6_bp  6  /* Interrupt Vector with High Priority bit 6 position. */
#define CPUINT_LVL1VEC7_bm  (1<<7)  /* Interrupt Vector with High Priority bit 7 mask. */
#define CPUINT_LVL1VEC7_bp  7  /* Interrupt Vector with High Priority bit 7 position. */

/* CRCSCAN - CRCSCAN */
/* CRCSCAN.CTRLA  bit masks and bit positions */
#define CRCSCAN_ENABLE_bm  0x01  /* Enable CRC scan bit mask. */
#define CRCSCAN_ENABLE_bp  0  /* Enable CRC scan bit position. */
#define CRCSCAN_NMIEN_bm  0x02  /* Enable NMI Trigger bit mask. */
#define CRCSCAN_NMIEN_bp  1  /* Enable NMI Trigger bit position. */
#define CRCSCAN_RESET_bm  0x80  /* Reset CRC scan bit mask. */
#define CRCSCAN_RESET_bp  7  /* Reset CRC scan bit position. */

/* CRCSCAN.CTRLB  bit masks and bit positions */
#define CRCSCAN_SRC_gm  0x03  /* CRC Source group mask. */
#define CRCSCAN_SRC_gp  0  /* CRC Source group position. */
#define CRCSCAN_SRC0_bm  (1<<0)  /* CRC Source bit 0 mask. */
#define CRCSCAN_SRC0_bp  0  /* CRC Source bit 0 position. */
#define CRCSCAN_SRC1_bm  (1<<1)  /* CRC Source bit 1 mask. */
#define CRCSCAN_SRC1_bp  1  /* CRC Source bit 1 position. */

/* CRCSCAN.STATUS  bit masks and bit positions */
#define CRCSCAN_BUSY_bm  0x01  /* CRC Busy bit mask. */
#define CRCSCAN_BUSY_bp  0  /* CRC Busy bit position. */
#define CRCSCAN_OK_bm  0x02  /* CRC Ok bit mask. */
#define CRCSCAN_OK_bp  1  /* CRC Ok bit position. */

/* EVSYS - Event System */
/* EVSYS.STROBE  bit masks and bit positions */
#define EVSYS_STROBE0_gm  0xFF  /* Software event on channels group mask. */
#define EVSYS_STROBE0_gp  0  /* Software event on channels group position. */
#define EVSYS_STROBE00_bm  (1<<0)  /* Software event on channels bit 0 mask. */
#define EVSYS_STROBE00_bp  0  /* Software event on channels bit 0 position. */
#define EVSYS_STROBE01_bm  (1<<1)  /* Software event on channels bit 1 mask. */
#define EVSYS_STROBE01_bp  1  /* Software event on channels bit 1 position. */
#define EVSYS_STROBE02_bm  (1<<2)  /* Software event on channels bit 2 mask. */
#define EVSYS_STROBE02_bp  2  /* Software event on channels bit 2 position. */
#define EVSYS_STROBE03_bm  (1<<3)  /* Software event on channels bit 3 mask. */
#define EVSYS_STROBE03_bp  3  /* Software event on channels bit 3 position. */
#define EVSYS_STROBE04_bm  (1<<4)  /* Software event on channels bit 4 mask. */
#define EVSYS_STROBE04_bp  4  /* Software event on channels bit 4 position. */
#define EVSYS_STROBE05_bm  (1<<5)  /* Software event on channels bit 5 mask. */
#define EVSYS_STROBE05_bp  5  /* Software event on channels bit 5 position. */
#define EVSYS_STROBE06_bm  (1<<6)  /* Software event on channels bit 6 mask. */
#define EVSYS_STROBE06_bp  6  /* Software event on channels bit 6 position. */
#define EVSYS_STROBE07_bm  (1<<7)  /* Software event on channels bit 7 mask. */
#define EVSYS_STROBE07_bp  7  /* Software event on channels bit 7 position. */

/* EVSYS.CHANNEL0  bit masks and bit positions */
#define EVSYS_GENERATOR_gm  0xFF  /* Generator selector group mask. */
#define EVSYS_GENERATOR_gp  0  /* Generator selector group position. */
#define EVSYS_GENERATOR0_bm  (1<<0)  /* Generator selector bit 0 mask. */
#define EVSYS_GENERATOR0_bp  0  /* Generator selector bit 0 position. */
#define EVSYS_GENERATOR1_bm  (1<<1)  /* Generator selector bit 1 mask. */
#define EVSYS_GENERATOR1_bp  1  /* Generator selector bit 1 position. */
#define EVSYS_GENERATOR2_bm  (1<<2)  /* Generator selector bit 2 mask. */
#define EVSYS_GENERATOR2_bp  2  /* Generator selector bit 2 position. */
#define EVSYS_GENERATOR3_bm  (1<<3)  /* Generator selector bit 3 mask. */
#define EVSYS_GENERATOR3_bp  3  /* Generator selector bit 3 position. */
#define EVSYS_GENERATOR4_bm  (1<<4)  /* Generator selector bit 4 mask. */
#define EVSYS_GENERATOR4_bp  4  /* Generator selector bit 4 position. */
#define EVSYS_GENERATOR5_bm  (1<<5)  /* Generator selector bit 5 mask. */
#define EVSYS_GENERATOR5_bp  5  /* Generator selector bit 5 position. */
#define EVSYS_GENERATOR6_bm  (1<<6)  /* Generator selector bit 6 mask. */
#define EVSYS_GENERATOR6_bp  6  /* Generator selector bit 6 position. */
#define EVSYS_GENERATOR7_bm  (1<<7)  /* Generator selector bit 7 mask. */
#define EVSYS_GENERATOR7_bp  7  /* Generator selector bit 7 position. */

